export const guidelines = {
    id: 1,
    title: "কমিউনিটি নির্দেশিকা",
    details: "আমাদের স্মার্ট কমিউনিটি প্ল্যাটফর্ম সকলের জন্য একটি নিরাপদ এবং শিক্ষণীয় স্থান হিসেবে তৈরি করা হয়েছে। তোমাদের অংশগ্রহণের মাধ্যমে আমরা এই প্লাটফর্মকে আরও সমৃদ্ধশীল এবং শিক্ষণীয় পরিবেশ তৈরি করতে চাই। তবে এর জন্যে নিম্নলিখিত নির্দেশিকা গুলোকে অবশ্যই মেনে চলতে হবে:",
    sections: [
        {
            id: "section-1",
            title: "সম্মান প্রদর্শন",
            detail: "সকল সদস্যের প্রতি সম্মান এবং শালীনতা বজায় রাখবে। ব্যক্তিগত আক্রমণ, কটুক্তি, এবং অশালীন মন্তব্য কঠোরভাবে নিষিদ্ধ।"
        },
        {
            id: "section-2",
            title: "পোস্টের ভাষা এবং বিষয়বস্তু",
            detail: 'অশ্লীল, আপত্তিকর, রাজনৈতিক এবং সহিংস বিষয়বস্তু পোস্ট করা যাবে না। শিক্ষামূলক এবং গঠনমূলক আলোচনায় আমরা উৎসাহ প্রদান করছি।'
        },
        {
            id: "section-3",
            title: "ব্যক্তিগত তথ্য সুরক্ষা",
            detail: "ব্যক্তিগত তথ্য সুরক্ষা সম্পর্কে সকলের প্রতি সম্মান এবং শালীনতা বজায় রাখবে।"
        },
        {
            id: "section-4",
            title: "ব্যবহারকারীর দায়িত্বশীলতা",
            detail: "ব্যবহারকারীর দায়িত্বশীলতা সম্পর্কে সকলের প্রতি সম্মান এবং শালীনতা বজায় রাখবে।"
        },
        {
            id: "section-5",
            title: "শেয়ার করবে না",
            detail: "শেয়ার করবে না।"
        },
        {
            id: "section-6",
            title: "স্পেমিং করবে না",
            detail: "অবাঞ্ছিত পোস্ট অথবা ক্ষুদ্র বার্তা বার বার দিয়ে গ্রুপের পরিবেশ নষ্ট করবে না। স্প্যামিং বা এই প্রকার সকল ধরনের প্রচারণা বা আচরণ থেকে বিরত থাকবে।"
        },
        {
            id: "section-7",
            title: "বিভিন্নতার সম্মান",
            detail: "ভিন্ন মতের প্রতি সকলের প্রতি সম্মান বজায় রাখবে।"
        },
        {
            id: "section-8",
            title: "কমিউনিটি নীতিমালার আপডেট",
            detail: "কমিউনিটি নীতিমালার আপডেট করবে।"
        },
        {
            id: "section-9",
            title: "ব্যান এবং সাসপেন্ড",
            detail: "উপরিউক্ত নীতিমালার যথাযথ অনুসরণ করবে। ভঙ্গ করা হলে কমিনিউটি থেকে বিতাড়িত করতে বাধ্য হবে।"
        }
    ]
}