
export const questions = [
    'আপনার সন্তানের জন্য কোন বিষয়গুলো সবচেয়ে গুরুত্বপূর্ণ? (আপনার সন্তানের সামগ্রিক উন্নয়নে মনোযোগ দিন)',
    'আপনার সন্তানের ভবিষ্যৎ লক্ষ্য কী হতে পারে? (সন্তানের পছন্দ এবং আগ্রহ অনুযায়ী সম্ভাব্য লক্ষ্য।)',
    'আপনার সন্তানের শিক্ষার ক্ষেত্রে আপনার ভয়গুলো কী কী? (পড়াশোনার বিভিন্ন সমস্যা বা উদ্বেগ বা পরীক্ষার ফলাফলের চাপ)',
    'অনলাইনে শিক্ষা গ্রহণের ক্ষেত্রে আপনার পছন্দ কী কী? (ডিজিটাল শিক্ষার ক্ষেত্রে আপনার চাহিদা।)',
    'আপনার সন্তান বিনোদনের জন্য কোন মাধ্যমগুলো ব্যবহার করে?',
]

export const important_factors = [
    {
        id: 1,
        name: 'বিজ্ঞান ও প্রযুক্তি শিক্ষা'
    },
    {
        id: 2,
        name: 'ইংরেজি ভাষার দক্ষতা বৃদ্ধি'
    },
    {
        id: 3,
        name: 'সৃজনশীল চিন্তার বিকাশ'
    },
    {
        id: 4,
        name: 'নৈতিক ও মানবিক শিক্ষা'
    },
    {
        id: 5,
        name: 'পরীক্ষায় ভালো ফলাফল অর্জন'
    },
    {
        id: 6,
        name: 'স্বাস্থ্যসম্মত জীবন যাপন'
    },
    {
        id: 7,
        name: 'নেতৃত্ব এবং সিদ্ধান্ত গ্রহণের দক্ষতা'
    },
    {
        id: 8,
        name: 'অন্যান্য'
    },
];

export const future_goals = [
    { id: 1, name: 'ডাক্তার' },
    { id: 2, name: 'ইঞ্জিনিয়ার' },
    { id: 3, name: 'শিক্ষক' },
    { id: 4, name: 'ব্যবসায়ী' },
    { id: 5, name: 'বিজ্ঞানী' },
    { id: 6, name: 'সরকারী কর্মকর্তা' },
    { id: 7, name: 'গবেষক' },
    { id: 8, name: 'লেখক' },
    { id: 9, name: 'কনটেন্ট ক্রিয়েটর' },
    { id: 10, name: 'অন্যান্য' },
];

export const education_concerns = [
    { id: 1, name: 'শিক্ষার মান নিয়ে উদ্বেগ' },
    { id: 2, name: 'সন্তানের মনোযোগ ধরে রাখার সমস্যা' },
    { id: 3, name: 'পরীক্ষার ফলাফলের চাপ' },
    { id: 4, name: 'দক্ষ এবং যোগ্য শিক্ষকের অভাব' },
    { id: 5, name: 'সহশিক্ষা কার্যক্রমে সন্তানের অংশগ্রহণের অভাব' },
    { id: 6, name: 'মোবাইলের সঠিক ব্যবহার নিয়ে ভয়' },
    { id: 7, name: 'সময় ব্যবস্থাপনার অভাব' },
    { id: 8, name: 'শারীরিক এবং মানসিক স্বাস্থ্যের সুরক্ষা' },
    { id: 9, name: 'অনুপ্রেরণা এবং অধ্যবসায়ের অভাব' },
    { id: 10, name: 'অন্যান্য' },
];

export const online_education_preferences = [
    { id: 1, name: 'লাইভ ক্লাসের সুবিধা' },
    { id: 2, name: 'রেকর্ডেড ভিডিও কনটেন্ট' },
    { id: 3, name: 'ইন্টারঅ্যাক্টিভ কুইজ এবং অ্যাসাইনমেন্ট' },
    { id: 4, name: 'সাপ্তাহিক রিপোর্ট এবং অগ্রগতির বিশ্লেষণ' },
    { id: 5, name: 'শিক্ষার খরচ কম' },
    { id: 6, name: 'দক্ষ শিক্ষকদের দায়িত্বশীল সাপোর্ট' },
    { id: 7, name: 'যাতায়াতের ভোগান্তি মুক্ত মাধ্যম' },
    { id: 10, name: 'অন্যান্য' },
];

export const entertainment_media = [
    { id: 1, name: 'টিভি' },
    { id: 2, name: 'ফেসবুক, টিকটক, ইউটিউব এ ভিডিও দেখা' },
    { id: 3, name: 'অনলাইনে গেম খেলা' },
    { id: 4, name: 'বই ও পড়াশোনা' },
    { id: 5, name: 'পেইন্টিং বা গান শোনা বা গাওয়া' },
    { id: 6, name: 'ক্রিকেট, ফুটবল বা ব্যাডমিন্টন বা অন্যান্য খেলাধুলা' },
    { id: 7, name: 'পরিবারসহ সময় কাটানো' },
    { id: 8, name: 'সিনেমা বা সিরিজ দেখা' },
    { id: 9, name: 'ঘোরাঘুরি বা ভ্রমণ' },
    { id: 10, name: 'অন্যান্য' },
];