export const collections = [
    {
        id: 1,
        title: 'পরীক্ষায় আসতে পারে',
    },
    {
        id: 2,
        title: 'প্রয়োজনীয় সূত্র',
    },
    {
        id: 3,
        title: 'অনুপ্রেরণামূলক কন্টেন্ট',
    },
    {
        id: 4,
        title: 'আইডিয়া',
    },
    {
        id: 5,
        title: 'সমাধান খুঁজছি',
    },
    {
        id: 6,
        title: 'বন্ধুদের সাথে শেয়ার করবো',
    },
    {
        id: 7,
        title: 'ভবিষ্যতের জন্য রেখেছি',
    },
    {
        id: 8,
        title: 'অন্যান্য',
    },
]