export const summary = {
    "success": true,
    "data": [
        {
            "id": "dbc9caa1-4012-4b42-a8a5-a7a19597edb9",
            "subject_id": "64798aa4330fd9518a1783db",
            "chapter_id": "64798aa4330fd9518a1783de",
            "word": "ভেক্টর",
            "definition": "ভেক্টর হল এমন একটি পরিমাণ যা এর মান, দিক এবং বিন্দু দ্বারা সংজ্ঞায়িত হয়। যেমন, বেগ, ত্বরণ, বল ইত্যাদি। একটি ভেক্টরকে একটি সরল রেখা দ্বারা চিহ্নিত করা হয় যার একটি প্রান্ত তীর দ্বারা চিহ্নিত।",
            "related_words": [
                "স্থান ভেক্টর",
                "বেগ ভেক্টর",
                "ত্বরণ ভেক্টর",
                "বল ভেক্টর"
            ],
            "created_at": "2024-11-01T16:57:36.440Z",
            "updated_at": "2024-11-01T16:57:36.440Z"
        },
        {
            "id": "5fe1a01e-08c3-4bc4-8730-9baefe32d341",
            "subject_id": "64798aa4330fd9518a1783db",
            "chapter_id": "64798aa4330fd9518a1783de",
            "word": "মুল বিন্দু",
            "definition": "গাণিতিক কো-অর্ডিনেট সিস্টেমের ঐ বিন্দুকে মুল বিন্দু বলা হয় যেটি সমস্ত অক্ষের ছেদবিন্দু হয়। এটি সাধারণত ওরিজিন হিসেবে পরিচিত হয় এবং এর কো-অর্ডিনেট হয় (0,0) এবং (0,0,0) ত্রিমাত্রিক সিস্টেমে।",
            "related_words": [
                "কো-অর্ডিনেট",
                "ওরিজিন",
                "কার্তেসিয়ান কো-অর্ডিনেট সিস্টেম"
            ],
            "created_at": "2024-11-01T16:57:36.440Z",
            "updated_at": "2024-11-01T16:57:36.440Z"
        },
        {
            "id": "7bb86419-9254-411e-8c45-3ab0b2de127a",
            "subject_id": "64798aa4330fd9518a1783db",
            "chapter_id": "64798aa4330fd9518a1783de",
            "word": "ডান পাশের উপরের বিন্দু",
            "definition": "একটি কো-অর্ডিনেট সিস্টেমের মধ্যে, 'ডান পাশের উপরের বিন্দু' হল এমন একটি বিন্দু যা মুল বিন্দুর থেকে ডান দিকে এবং উপরে অবস্থিত। এই বিন্দুর কো-অর্ডিনেট সাধারণত ধনাত্মক হয়।",
            "related_words": [
                "কো-অর্ডিনেট",
                "মুল বিন্দু",
                "বিন্দু"
            ],
            "created_at": "2024-11-01T16:57:36.440Z",
            "updated_at": "2024-11-01T16:57:36.440Z"
        }
    ]
}